Public Attributes | List of all members
API_ElemURLRef Struct Reference
Element Manager API
URL reference to be stored into elements. More...
#include <APIdefs_Database.h>
 Public Attributes
char  | urlLink [512]
The URL link (e.g., "http://www.graphisoft.com")
char  | description [256]
Description for the URL above (e.g., "GRAPHISOFT Home Page").
char  | filler [256]
Detailed Description
URL reference to be stored into elements.
Remarks
This structure is used for storing URL references into Archicad database elements. The element URL data can be accessed with the ACAPI_Element_GetElementURLRef and ACAPI_Element_SetElementURLRef database functions.
Member Data Documentation
◆ description
 API_ElemURLRef::description
Description for the URL above (e.g., "GRAPHISOFT Home Page").
◆ filler
 char API_ElemURLRef::filler[256]
◆ urlLink
 API_ElemURLRef::urlLink
The URL link (e.g., "http://www.graphisoft.com")